Revit 2024 API
Document.ParameterBindings Property
Retrieves an object from which mappings between parameter definitions and categories can be found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public BindingMap ParameterBindings { get; }
Visual Basic
Public ReadOnly Property ParameterBindings As BindingMap
	Get
Visual C++
public:
property BindingMap^ ParameterBindings {
	BindingMap^ get ();
}
Remarks
Returns a mapping between parameter definitions and parameter bindings. New bindings can be added to the Revit Document by using this object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | When the document is a family document.
See Also
Document Class
Autodesk.Revit.DB Namespace